In [1]:
import pandas as pd

In [3]:
# used for data Manipulation and data Analysis.
# pandas is built on the top of the numpy package.
# Panel Data -----> Pandas
# In Pandas we have 2 data structures -----> 1. Series 2. Dataframe

In [5]:
# Series
# it ios a sequence of data values

In [6]:
pd.Series([11,23,45,56,89])

0    11
1    23
2    45
3    56
4    89
dtype: int64

In [7]:
pd.Series([11,23,45,56,89], index=['Fanta', 'Sprite', 'Coke', 'Limca', 'Slice'], name='Drink')

Fanta     11
Sprite    23
Coke      45
Limca     56
Slice     89
Name: Drink, dtype: int64

In [8]:
# DataFrame
# A DataFrame is nothing but a table.

In [9]:
pd.DataFrame({'Yes':[50,21,56], 'No':[101,20,11]})

   Yes   No
0   50  101
1   21   20
2   56   11

In [12]:
pd.DataFrame({'BOB': ['I Like it', 'It was awful'], 'Sue': ['Pretty good', 'Bland']}, index=['Product A', 'Product B'])

                    BOB          Sue
Product A     I Like it  Pretty good
Product B  It was awful        Bland

In [13]:
pwd()

'C:\\Users\\om\\OneDrive\\Desktop\\Machine Learning'

In [14]:
df = pd.read_csv(r"Data.csv")

In [15]:
df

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
df['phy']

0    70
1    67
2    55
3    70
4    29
5    89
Name: phy, dtype: int64

In [18]:
df[['name','result']]

    name result
0    tom   Pass
1   jhon   Pass
2    max   Fail
3    raj   Pass
4  shyam   Fail
5    ram   Pass

In [19]:
df.columns

Index(['name', 'maths', 'phy', 'result'], dtype='object')

In [20]:
df.shape

(6, 4)

In [21]:
df.head()

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail

In [22]:
df.tail()

    name  maths  phy result
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [25]:
df2 = pd.read_csv(r"tdata (1).tsv", sep="\t")

In [26]:
df2

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [27]:
# Info

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   maths   6 non-null      int64
 2   phy     6 non-null      int64
 3   result  6 non-null      object
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [29]:
df.isnull()

    name  maths    phy  result
0  False  False  False   False
1  False  False  False   False
2  False  False  False   False
3  False  False  False   False
4  False  False  False   False
5  False  False  False   False

In [30]:
df.isnull().sum()

name      0
maths     0
phy       0
result    0
dtype: int64